---
kind: type
id: T:Autodesk.Revit.DB.SelectionFilterAction
source: html/c78f7e32-a50e-d092-c8c5-6371464a747c.htm
---
# Autodesk.Revit.DB.SelectionFilterAction

An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.

## Syntax (C#)
```csharp
public enum SelectionFilterAction
```